_posts/2013-04-23-migration-to-jekyll.html
---
layout: post
title: "Migration to Jekyll"
description: ""
comments: true
category: blog
tags: [migration, blog, posts, import]
---
{% include JB/setup %}


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The blogger exodus</h2>
<div class="outline-text-2" id="text-1">


<p>
I wan't to start writting some blog posts so I've thought that I will start from
migration of My old blog on Blogger (<a href="http://blog.wysocki.org.pl">http://blog.wysocki.org.pl</a>) to new and shiny
Jekyll powered blog engine (<a href="http://exu.github.io">http://exu.github.io</a>) - domain will be changed later.
Why? It looks like good idea to have everything in git. And what is most important
I can write my posts in Org-mode (markdown sucks so much!)
</p>


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">I've used several tools to complete this job:</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>Jekyll <a href="http://jekyllrb.com/">http://jekyllrb.com/</a>
</li>
<li><a href="http://jekyllbootstrap.com/">http://jekyllbootstrap.com/</a>
</li>
<li><a href="https://gist.github.com/kennym/1115810">https://gist.github.com/kennym/1115810</a> (I've changed <code>Config</code> to <code>RbConfig</code> because of deprecation warning)'
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Org-mode integration</h3>
<div class="outline-text-3" id="text-1-2">


<p>
<code>org</code> directory in jekyll root directory structure similar to root directory.
I have <code>_posts</code> directory with org files inside
</p>
<p>
To avoid <code>&lt;p&gt;</code> tags in jekyll parameters I've put them between <code>#+BEGIN_HTML</code> and <code>#+END_HTML</code> tags
</p>



<pre class="example">#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: H:4 num:nil tags:nil toc:nil timestamps:t
#+BEGIN_HTML
---
layout: post
title: "Migration to Jekyll"
description: ""
comments: true
category: blog
tags: [migration, blog, posts, import]
---
{% include JB/setup %}
</pre>


<p>
I've added some little helper to publish org files by hitting one key:
</p>



<pre class="example">(setq org-publish-project-alist
      '(

  ("github"
          ;; Path to your org files.
          :base-directory "~/Workspace/exu.github.com/org/"
          :base-extension "org"

          ;; Path to your Jekyll project.
          :publishing-directory "~/Workspace/exu.github.com/"
          :recursive t
          :publishing-function org-publish-org-to-html
          :headline-levels 4
          :html-extension "html"
          :body-only t ;; Only export section between &lt;body&gt; &lt;/body&gt;
    )
))

(defun publish-blog ()
  (interactive)
  (org-publish "github")
  )

(global-set-key (kbd "&lt;f12&gt;") 'publish-blog)
</pre>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Todo Left [3/6]:</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><code>[X]</code> Make new home page
</li>
<li><code>[X]</code> Integrate Org-mode to work on github pages
</li>
<li><code>[&nbsp;]</code> Add some static pages with informations
</li>
<li><code>[&nbsp;]</code> Migrate domain: blog.wysocki.org.pl
</li>
<li><code>[&nbsp;]</code> Make some Bootstrap layout
</li>
<li><code>[X]</code> Find some nice font
</li>
</ul>

</div>
</div>
</div>
